amarildolacerda/homeware/clients/esp8266_lampada/src/main.cpp
#define ESPNOW_HEADER_FIXED_SIZE (sizeof(espnow_header_t) - sizeof(((espnow_header_t*)0)->payload))

static bool espnow_send_data(void)
{
    if (!s_paired || !s_espnow_ready) return false;

    uint8_t buf[ESPNOW_HEADER_FIXED_SIZE + sizeof(payload_onoff_t) + 4];
    memset(buf, 0, sizeof(buf));

    espnow_header_t *hdr = (espnow_header_t *)buf;
    hdr->version = ESPNOW_PROTOCOL_VERSION;
    hdr->msg_type = ESPNOW_MSG_SENSOR_DATA;
    hdr->sequence = s_sequence++;
    WiFi.macAddress(hdr->sensor_mac);
    hdr->sensor_type = SENSOR_TYPE_ONOFF;
    hdr->battery_pct = (uint8_t)s_battery;
    hdr->rssi = (int16_t)WiFi.RSSI();

    payload_onoff_t *pl = (payload_onoff_t *)hdr->payload;
    pl->state = s_relay_state ? 1 : 0;

    IPAddress ip = WiFi.localIP();
    uint8_t *ip_ptr = hdr->payload + sizeof(payload_onoff_t);
    ip_ptr[0] = ip[0];
    ip_ptr[1] = ip[1];
    ip_ptr[2] = ip[2];
    ip_ptr[3] = ip[3];
    hdr->payload_len = sizeof(payload_onoff_t) + 4;

    if (!espnow_add_peer(s_gateway_mac))
    {
        Serial.printf("[%s] Failed to add gateway peer\n", TAG);
        return false;
    }

    s_ack_received = false;
    s_send_pending = true;
    int ret = esp_now_send(s_gateway_mac, buf, sizeof(buf));
    if (ret != 0)
    {
        Serial.printf("[%s] ESP-NOW send failed: %d\n", TAG, ret);
        s_send_pending = false;
        return false;
    }
    return true;
}

static bool espnow_send_heartbeat(void)
{
    if (!s_paired || !s_espnow_ready) return false;

    uint8_t buf[ESPNOW_HEADER_FIXED_SIZE];
    memset(buf, 0, sizeof(buf));

    espnow_header_t *hdr = (espnow_header_t *)buf;
    hdr->version = ESPNOW_PROTOCOL_VERSION;
    hdr->msg_type = ESPNOW_MSG_HEARTBEAT;
    hdr->sequence = s_sequence++;
    WiFi.macAddress(hdr->sensor_mac);
    hdr->sensor_type = SENSOR_TYPE_ONOFF;
    hdr->battery_pct = (uint8_t)s_battery;
    hdr->rssi = (int16_t)WiFi.RSSI();
    hdr->payload_len = 0;

    if (!espnow_add_peer(s_gateway_mac)) return false;

    s_ack_received = false;
    return esp_now_send(s_gateway_mac, buf, sizeof(buf)) == 0;
}

static bool espnow_send_pair_request(void)
{
    if (!s_espnow_ready) return false;

    uint8_t buf[sizeof(espnow_pair_request_t)];
    memset(buf, 0, sizeof(buf));

    espnow_pair_request_t *req = (espnow_pair_request_t *)buf;
    req->msg_type = ESPNOW_MSG_PAIR_REQUEST;
    req->sequence = s_sequence++;
    WiFi.macAddress(req->sensor_mac);
    req->sensor_type = SENSOR_TYPE_ONOFF;
    uint32_t ver = 0x000A000B;
    req->firmware_version[0] = (uint8_t)(ver >> 24);
    req->firmware_version[1] = (uint8_t)(ver >> 16);
    req->firmware_version[2] = (uint8_t)(ver >> 8);
    req->firmware_version[3] = (uint8_t)(ver);
    strncpy(req->device_name, s_device_name, sizeof(req->device_name) - 1);
    req->device_name[sizeof(req->device_name) - 1] = '\0';

    if (!espnow_add_peer(s_broadcast_mac)) return false;

    s_ack_received = false;
    int ret = esp_now_send(s_broadcast_mac, buf, sizeof(buf));
    if (ret != 0)
    {
        Serial.printf("[%s] Pair request send failed: %d\n", TAG, ret);
        return false;
    }
    return true;
}

static void set_relay(bool state)
{
    s_relay_state = state;
    digitalWrite(RELAY_PIN, state ? RELAY_ON : !RELAY_ON);
    save_relay_state();
}

static void toggle_relay(void)
{
    set_relay(!s_relay_state);
}

static void fauxmo_callback(unsigned char device_id, const char *device_name, bool state, unsigned char value)
{
    (void)device_id;
    (void)value;
    Serial.printf("[%s] Alexa: %s -> %s\n", TAG, device_name, state ? "ON" : "OFF");
    set_relay(state);
    if (s_paired)
    {
        s_last_espnow_send = 0;
        espnow_send_data();
    }
}

static void init_hardware(void)
{
    pinMode(RELAY_PIN, OUTPUT);
    load_relay_state();
    digitalWrite(RELAY_PIN, s_relay_state ? RELAY_ON : !RELAY_ON);
#ifdef LED_PIN
    pinMode(LED_PIN, OUTPUT);
    digitalWrite(LED_PIN, LOW);
#endif
}

static bool wifi_setup(bool force_config_portal = false)
{
    WiFiManager wifiManager;
    wifiManager.setConnectTimeout(20);

    if (!force_config_portal && WiFi.SSID() != "")
    {
        wifiManager.setTimeout(180);
        wifiManager.setConnectRetries(3);
        Serial.printf("[%s] Connecting to saved WiFi: %s\n", TAG, WiFi.SSID().c_str());
        if (wifiManager.autoConnect())
        {
            Serial.printf("[%s] WiFi connected! IP: %s\n", TAG, WiFi.localIP().toString().c_str());
            s_wifi_configuration_mode = false;
            return true;
        }
        Serial.printf("[%s] Failed to connect to saved WiFi\n", TAG);
    }

    Serial.printf("[%s] Starting configuration portal...\n", TAG);
    s_wifi_configuration_mode = true;
    s_wifi_config_start_time = millis();
    wifiManager.setConfigPortalTimeout(300);

    char buf_repeater[20];
    buf_repeater[0] = '\0';
    WiFiManagerParameter custom_dev_name("dev_name", "Device Name", s_device_name, 48);
    wifiManager.addParameter(&custom_dev_name);
    WiFiManagerParameter custom_repeater("repeater_mac", "Repeater MAC (vazio=normal)", buf_repeater, 18);
    wifiManager.addParameter(&custom_repeater);

    if (wifiManager.startConfigPortal(WIFI_CONFIG_PORTAL_SSID, WIFI_CONFIG_PORTAL_PASS))
    {
        if (strlen(custom_dev_name.getValue()) > 0 && strcmp(s_device_name, custom_dev_name.getValue()) != 0)
        {
            strncpy(s_device_name, custom_dev_name.getValue(), sizeof(s_device_name) - 1);
            s_device_name[sizeof(s_device_name) - 1] = '\0';
            save_device_name(s_device_name);
        }
        if (strlen(custom_repeater.getValue()) > 0)
        {
            if (mac_parse(custom_repeater.getValue(), s_gateway_mac))
            {
                s_use_repeater = true;
                s_paired = true; // no pair needed, use repeater directly
                save_gateway_mac(s_gateway_mac);
            }
        }
        s_wifi_configuration_mode = false;
        return true;
    }

    Serial.printf("[%s] Configuration portal timed out\n", TAG);
    s_wifi_configuration_mode = false;
    return false;
}

static void maintain_wifi_connection(void)
{
    if (WiFi.status() == WL_CONNECTED)
        return;
    unsigned long now = millis();
    if (now - s_last_reconnect_attempt < 30000)
        return;
    s_last_reconnect_attempt = now;

    Serial.printf("[%s] WiFi disconnected. Reconnecting...\n", TAG);
    WiFi.begin();
    unsigned long connect_start = millis();
    while (millis() - connect_start < 15000)
    {
        if (WiFi.status() == WL_CONNECTED)
        {
            Serial.printf("[%s] Reconnected! IP: %s\n", TAG, WiFi.localIP().toString().c_str());
            return;
        }
        delay(500);
    }

    static unsigned long last_config_attempt = 0;
    if (now - last_config_attempt > 300000)
    {
        last_config_attempt = now;
        wifi_setup(true);
    }
}

static void check_config_portal_timeout(void)
{
    if (s_wifi_configuration_mode && (millis() - s_wifi_config_start_time > 600000))
    {
        Serial.printf("[%s] Config portal timeout. Restarting...\n", TAG);
        ESP.restart();
    }
}

