amarildolacerda/homeware/clients/esp8266_lampada/src/main.cpp
static void handle_root(void)
{
    s_server.send(200, "text/html", FPSTR(PAGE_DASHBOARD));
}

static void handle_api_state(void)
{
    String json;
    {
        JsonDocument doc;
        doc["state"] = s_relay_state;
        doc["battery"] = s_battery;
        doc["device_id"] = s_device_id;
        doc["device_name"] = s_device_name;
        doc["gateway_connected"] = s_gateway_connected;
        doc["paired"] = s_paired;
        doc["ip"] = WiFi.localIP().toString();
        doc["rssi"] = WiFi.RSSI();
        doc["uptime_s"] = (millis() - s_start_time) / 1000;
        if (s_last_send_ms) doc["last_send_s"] = (millis() - s_last_send_ms) / 1000;
        doc["slot"] = s_assigned_slot;
        serializeJson(doc, json);
    }
    s_server.send(200, "application/json", json);
}

static void handle_api_relay(void)
{
    if (s_server.method() == HTTP_GET)
    {
        String json;
        JsonDocument doc;
        doc["state"] = s_relay_state;
        serializeJson(doc, json);
        s_server.send(200, "application/json", json);
    }
    else if (s_server.method() == HTTP_POST)
    {
        String body = s_server.arg("plain");
        JsonDocument doc;
        DeserializationError err = deserializeJson(doc, body);
        if (err)
        {
            s_server.send(400, "application/json", "{\"error\":\"invalid JSON\"}");
            return;
        }
        if (doc.containsKey("state"))
        {
            bool new_state = doc["state"];
            set_relay(new_state);
            Serial.printf("[%s] Relay set to %s via API\n", TAG, new_state ? "ON" : "OFF");
            String json;
            JsonDocument resp;
            resp["state"] = s_relay_state;
            resp["status"] = "ok";
            serializeJson(resp, json);
            s_server.send(200, "application/json", json);
            s_last_state_update = 0;
        }
        else
        {
            s_server.send(400, "application/json", "{\"error\":\"missing state\"}");
        }
    }
}

static void handle_api_pin(void)
{
    if (s_server.method() == HTTP_GET)
    {
        int pin = s_server.arg("gpio").toInt();
        pinMode(pin, INPUT_PULLUP);
        int state = digitalRead(pin);
        String json;
        JsonDocument doc;
        doc["gpio"] = pin;
        doc["state"] = state;
        serializeJson(doc, json);
        s_server.send(200, "application/json", json);
    }
    else if (s_server.method() == HTTP_POST)
    {
        String body = s_server.arg("plain");
        JsonDocument doc;
        DeserializationError err = deserializeJson(doc, body);
        if (err)
        {
            s_server.send(400, "application/json", "{\"error\":\"invalid JSON\"}");
            return;
        }
        int pin = doc["gpio"] | -1;
        if (pin < 0 || pin > 16)
        {
            s_server.send(400, "application/json", "{\"error\":\"invalid gpio\"}");
            return;
        }
        int state = doc["state"] | -1;
        if (state != 0 && state != 1)
        {
            s_server.send(400, "application/json", "{\"error\":\"state must be 0 or 1\"}");
            return;
        }
        pinMode(pin, OUTPUT);
        digitalWrite(pin, state);
        String json;
        JsonDocument resp;
        resp["gpio"] = pin;
        resp["state"] = state;
        resp["status"] = "ok";
        serializeJson(resp, json);
        s_server.send(200, "application/json", json);
    }
}

static void handle_serial(void)
{
    if (Serial.available() <= 0)
        return;
    char c = Serial.read();
    switch (c)
    {
    case 'R':
    case 'r':
        ESP.restart();
        break;
    case 'l':
    case 'L':
    {
        Serial.printf("\n--- Controle da Lampada ---\n");
        toggle_relay();
        Serial.printf("  Lampada: %s\n", s_relay_state ? "LIGADA" : "DESLIGADA");
        if (s_paired)
        {
            s_last_espnow_send = 0;
            if (espnow_send_data())
                s_last_send_ms = millis();
        }
        else
        {
            Serial.printf("  (gateway nao pareado)\n");
        }
        Serial.printf("--------------------------\n\n");
        break;
    }
    case '0':
        set_relay(false);
        Serial.printf("[%s] Relay OFF\n", TAG);
        if (s_paired) { s_last_espnow_send = 0; espnow_send_data(); }
        break;
    case '1':
        set_relay(true);
        Serial.printf("[%s] Relay ON\n", TAG);
        if (s_paired) { s_last_espnow_send = 0; espnow_send_data(); }
        break;
    case 'u':
    case 'U':
        Serial.printf("\n--- OTA ---\n");
        Serial.printf("  Hostname: %s.local\n", s_device_id);
        Serial.printf("  Port:     8266 (ArduinoOTA)\n");
        Serial.printf("  PlatformIO CLI:\n");
        Serial.printf("    pio run -t upload --upload-port %s.local\n", s_device_id);
        Serial.printf("  espota.py:\n");
        Serial.printf("    espota.py -i %s.local -p 8266 -f firmware.bin\n", s_device_id);
        Serial.printf("-------------\n\n");
        break;
    case 'p':
    case 'P':
    {
        Serial.printf("\n--- Par ---\n");
        s_paired = false;
        s_gateway_connected = false;
        s_pair_attempts = 0;
        Serial.printf("  Estado de pareamento resetado\n");
        Serial.printf("  Enviando requisicao de par...\n");
        if (espnow_send_pair_request())
            Serial.printf("  Requisicao enviada!\n");
        else
            Serial.printf("  Falha ao enviar requisicao\n");
        Serial.printf("----------------\n\n");
        break;
    }
    case 'h':
    case 'H':
    case '?':
        Serial.printf("\n--- Comandos ---\n");
        Serial.printf("  l    - liga/desliga lampada\n");
        Serial.printf("  0    - desligar\n");
        Serial.printf("  1    - ligar\n");
        Serial.printf("  r    - reset\n");
        Serial.printf("  s    - status do dispositivo\n");
        Serial.printf("  p    - resetar par e tentar parear\n");
        Serial.printf("  u    - info OTA\n");
        Serial.printf("  a    - info Alexa\n");
        Serial.printf("  h/?  - esta ajuda\n");
        Serial.printf("  Dashboard: http://%s:%d\n", WiFi.localIP().toString().c_str(), DASHBOARD_PORT);
        if (s_paired)
        {
            char mac_str[18];
            mac_to_str(s_gateway_mac, mac_str, sizeof(mac_str));
            Serial.printf("  Gateway: %s (slot %d)\n", mac_str, s_assigned_slot);
        }
        Serial.printf("  IP local: %s\n", WiFi.localIP().toString().c_str());
        Serial.printf("  RSSI:     %d dBm\n", WiFi.RSSI());
        Serial.printf("  Up:       %lu s\n", (millis() - s_start_time) / 1000);
        Serial.printf("----------------\n\n");
        break;
    case 'a':
    case 'A':
        Serial.printf("\n--- Alexa ---\n");
        Serial.printf("  Dispositivo: %s\n", s_device_name);
        Serial.printf("  Protocolo:   UPnP (Wemo emulation)\n");
        Serial.printf("  Porta:       %d\n", FAUXMO_PORT);
        Serial.printf("  Status:      ativo\n");
        Serial.printf("  Dica:        \"Alexa, ligue %s\"\n", s_device_name);
        Serial.printf("               \"Alexa, desligue %s\"\n", s_device_name);
        Serial.printf("-------------\n\n");
        break;
    case 's':
    case 'S':
    {
        unsigned long up = (millis() - s_start_time) / 1000;
        Serial.printf("\n--- Status ---\n");
        Serial.printf("  Dispositivo: %s\n", s_device_id);
        Serial.printf("  Nome:        %s\n", s_device_name);
        Serial.printf("  Lampada:     %s\n", s_relay_state ? "LIGADA" : "DESLIGADA");
        Serial.printf("  Bateria:     %d %%\n", s_battery);
        if (s_paired)
        {
            char mac_str[18];
            mac_to_str(s_gateway_mac, mac_str, sizeof(mac_str));
            Serial.printf("  Gateway:     %s (slot %d) %s\n", mac_str, s_assigned_slot,
                          s_gateway_connected ? "conectado" : "desconectado");
        }
        else
        {
            Serial.printf("  Gateway:     nao pareado\n");
        }
        Serial.printf("  Dashboard:   http://%s:%d\n", WiFi.localIP().toString().c_str(), DASHBOARD_PORT);
        Serial.printf("  Alexa:       %s (UPnP port %d)\n", s_device_name, FAUXMO_PORT);
        if (s_use_repeater)
        {
            char mac_str[18];
            mac_to_str(s_gateway_mac, mac_str, sizeof(mac_str));
            Serial.printf("  Repeater:    %s\n", mac_str);
        }
        Serial.printf("  RSSI:        %d dBm\n", WiFi.RSSI());
        Serial.printf("  Uptime:      %lu s\n", up);
        Serial.printf("---------------\n\n");
        break;
    }
    }
}

static void handle_ota(void)
{
    if (!Update.hasError())
    {
        s_server.send(200, "application/json", "{\"status\":\"ok\"}");
        delay(500);
        ESP.restart();
    }
    else
    {
        s_server.send(500, "application/json", "{\"status\":\"error\"}");
    }
}

static void handle_ota_upload(void)
{
    HTTPUpload &upload = s_server.upload();
    if (upload.status == UPLOAD_FILE_START)
    {
        Serial.printf("[%s] OTA update started: %s (%d bytes)\n", TAG, upload.filename.c_str(), upload.totalSize);
        if (!Update.begin(upload.totalSize))
            Update.printError(Serial);
    }
    else if (upload.status == UPLOAD_FILE_WRITE)
    {
        if (Update.write(upload.buf, upload.currentSize) != upload.currentSize)
            Update.printError(Serial);
    }
    else if (upload.status == UPLOAD_FILE_END)
    {
        if (Update.end(true))
            Serial.printf("[%s] OTA update success: %d bytes\n", TAG, upload.totalSize);
        else
            Update.printError(Serial);
    }
}

void setup(void)
{
    Serial.begin(115200);
    delay(1000);
    s_start_time = millis();

    uint32_t chip_id = ESP.getChipId();
    snprintf(s_device_id, sizeof(s_device_id), "esp8266_%06x", chip_id);

    load_device_name();

    Serial.printf("\n");
    Serial.printf("============================================\n");
    Serial.printf("  ESP8266 Lampada " FW_VERSION "\n");
    Serial.printf("  Device: %s\n", s_device_id);
    Serial.printf("  Nome:   %s\n", s_device_name);
    Serial.printf("============================================\n");

