amarildolacerda/homeware/clients/esp8266_lampada/src/main.cpp
    randomSeed(analogRead(A0));
    init_hardware();
    Serial.printf("============================================\n");

    if (!wifi_setup(false))
    {
        Serial.printf("[%s] WiFi setup failed, restarting...\n", TAG);
        delay(5000);
        ESP.restart();
    }

    espnow_init_client();

    s_fauxmo.createServer(true);
    s_fauxmo.addDevice(s_device_name);
    s_fauxmo.onSetState(fauxmo_callback);
    s_fauxmo.enable(true);
    Serial.printf("[%s] Alexa UPnP: %s device ready on port %d\n", TAG, s_device_name, FAUXMO_PORT);

    s_server.on("/", handle_root);
    s_server.on("/api/state", handle_api_state);
    s_server.on("/api/relay", handle_api_relay);
    s_server.on("/api/pin", handle_api_pin);
    s_server.on("/api/ota", HTTP_POST, handle_ota, handle_ota_upload);
    s_server.begin();

    ArduinoOTA.setHostname(s_device_id);
    ArduinoOTA.onStart([]() { Serial.printf("[%s] OTA update start\n", TAG); });
    ArduinoOTA.onEnd([]() { Serial.printf("[%s] OTA update end\n", TAG); });
    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
        Serial.printf("[%s] OTA progress: %u%%\r", TAG, (progress * 100) / total);
    });
    ArduinoOTA.onError([](ota_error_t error) {
        Serial.printf("[%s] OTA error: %d\n", TAG, error);
    });
    ArduinoOTA.begin();
    Serial.printf("[%s] OTA ready: %s.local\n", TAG, s_device_id);

    Serial.printf("\n  => Dashboard: http://%s:%d\n", WiFi.localIP().toString().c_str(), DASHBOARD_PORT);
    Serial.printf("  => Alexa:     \"Alexa, ligue %s\"\n", s_device_name);
    Serial.printf("  => Terminal:  'h' comando de ajuda\n");

    /* Check for REPEATER_MAC from config.h */
    if (strlen(REPEATER_MAC) > 0 && mac_parse(REPEATER_MAC, s_gateway_mac))
    {
        s_use_repeater = true;
        s_paired = true;
        char mac_str[18];
        mac_to_str(s_gateway_mac, mac_str, sizeof(mac_str));
        Serial.printf("[%s] Using repeater MAC: %s\n", TAG, mac_str);
    }
    else if (load_gateway_mac())
    {
        Serial.printf("[%s] Gateway MAC loaded from EEPROM\n", TAG);
        s_paired = true;
    }
    else
    {
        Serial.printf("[%s] No saved gateway MAC, will pair\n", TAG);
    }

    Serial.printf("============================================\n");
    Serial.printf("  Pronto! Pressione 'h' para ajuda\n");
    Serial.printf("============================================\n\n");
}

void loop(void)
{
    handle_serial();
    check_config_portal_timeout();
    ArduinoOTA.handle();
    s_server.handleClient();
    s_fauxmo.handle();

    if (WiFi.status() != WL_CONNECTED)
    {
        maintain_wifi_connection();
        delay(1000);
        return;
    }

    unsigned long now = millis();

    if (!s_paired)
    {
        if (now - s_last_espnow_pair > ESPNOW_PAIR_INTERVAL_MS)
        {
            s_last_espnow_pair = now;
            s_pair_attempts++;
            Serial.printf("[%s] Pair attempt %d/%d\n", TAG, s_pair_attempts, ESPNOW_MAX_PAIR_ATTEMPTS);
            espnow_send_pair_request();
            if (s_pair_attempts >= ESPNOW_MAX_PAIR_ATTEMPTS)
            {
                s_pair_attempts = 0;
                Serial.printf("[%s] Max pair attempts, waiting before retry\n", TAG);
                delay(60000);
            }
        }
        delay(1);
        return;
    }

    if (now - s_last_espnow_send > STATE_UPDATE_INTERVAL)
    {
        s_last_espnow_send = now;
        s_ack_received = false;
        if (espnow_send_data())
        {
            unsigned long deadline = millis() + ESPNOW_ACK_TIMEOUT_MS;
            while (millis() < deadline)
            {
                if (s_ack_received) break;
                delay(1);
            }
            if (s_ack_received)
            {
                s_gateway_connected = true;
                s_last_send_ms = millis();
            }
            else
            {
                s_gateway_connected = false;
                bool ok = false;
                for (int retry = 0; retry < ESPNOW_SEND_RETRIES; retry++)
                {
                    delay(50);
                    s_ack_received = false;
                    if (espnow_send_data())
                    {
                        deadline = millis() + ESPNOW_ACK_TIMEOUT_MS;
                        while (millis() < deadline)
                        {
                            if (s_ack_received) break;
                            delay(1);
                        }
                        if (s_ack_received) { ok = true; break; }
                    }
                }
                if (ok)
                {
                    s_gateway_connected = true;
                    s_last_send_ms = millis();
                }
                else
                {
                    Serial.printf("[%s] Send failed after %d retries, re-pairing\n", TAG, ESPNOW_SEND_RETRIES);
                    s_paired = false;
                    s_pair_attempts = 0;
                    s_last_espnow_pair = 0;
                }
            }
        }
    }

    if (now - s_last_heartbeat > HEARTBEAT_INTERVAL)
    {
        s_last_heartbeat = now;
        Serial.printf("[%s] RSSI=%d dBm  up=%lus\n", TAG, WiFi.RSSI(), (millis() - s_start_time) / 1000);
        if (s_paired)
            espnow_send_heartbeat();
    }

#ifdef LED_PIN
    static unsigned long last_led = 0;
    if (s_wifi_configuration_mode)
    {
        digitalWrite(LED_PIN, HIGH);
    }
    else if (WiFi.status() != WL_CONNECTED)
    {
        if (now - last_led >= LED_BLINK_WIFI_MS)
        {
            last_led = now;
            digitalWrite(LED_PIN, !digitalRead(LED_PIN));
        }
    }
    else if (!s_paired)
    {
        if (now - last_led >= LED_BLINK_GATEWAY_MS)
        {
            last_led = now;
            digitalWrite(LED_PIN, !digitalRead(LED_PIN));
        }
    }
    else
    {
        digitalWrite(LED_PIN, LOW);
    }
#endif

    delay(1);
}
